# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
res = []

for e in range((len(list) + 1 ) // 2):
    res.append(list[e] * list[len(list) - 1 - e])

print(f'Произведение равно:  {res}')